DataProcessors/ВосстановлениеПоследовательностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВосстановлениеПоследовательностей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеГраницыПоследовательности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ВосстановлениеПоследовательностей/Forms/ДокументыПоследовательности/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, ЭтаФорма.Параметры, "Организация, СчетДоверительногоУправления, ОграничениеГраницыПоследовательности");
	
	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("Организация",                  Объект.Организация);
	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("Период",                       Объект.ОграничениеГраницыПоследовательности);
	
	ЭтаФорма.ОграничитьГраницуПоследовательности = ЗначениеЗаполнено(Объект.ОграничениеГраницыПоследовательности);
	
	Элементы.ОграничениеГраницыПоследовательности.Видимость = ЭтаФорма.ОграничитьГраницуПоследовательности;
	
	ЭтаФорма.Заголовок = Объект.СчетДоверительногоУправления;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("СчетДоверительногоУправления", Объект.СчетДоверительногоУправления);
	
	ЭтаФорма.Заголовок = Объект.СчетДоверительногоУправления;
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьГраницуПоследовательностиПриИзменении(Элемент)
	
	Элементы.ОграничениеГраницыПоследовательности.Видимость = ЭтаФорма.ОграничитьГраницуПоследовательности;
	
	Если Не ЭтаФорма.ОграничитьГраницуПоследовательности Тогда
		Объект.ОграничениеГраницыПоследовательности = Неопределено;
	КонецЕсли;
	
	ЭтаФорма.ДокументыПоследовательности.Параметры.УстановитьЗначениеПараметра("Период", Объект.ОграничениеГраницыПоследовательности);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоследовательностиПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ДокументыПоследовательности.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	Если  Элементы.ДокументыПоследовательности.ТекущийЭлемент = Элементы.ДокументыПоследовательностиРегистратор Тогда
		ОткрытьЗначение(ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры
